; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v8 - type_1 ?v2 - type_2)
 	      (pred_3 ?v7 - object ?v2 - type_2)
	      (pred_4 ?v8 - type_1 ?v1 - type_3)
	      (pred_2 ?v8 - type_1 ?v7 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v8 - type_1 ?v5 ?v3 - type_2)
       :precondition (and  (pred_1 ?v8 ?v5))
       :effect (and  (pred_1 ?v8 ?v3)
		     (not (pred_1 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_1 ?v8 ?v4) (pred_4 ?v8 ?v1))
       :effect (and (pred_2 ?v8 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_4 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v1) (pred_1 ?v8 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_4 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v6 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_1
obj_06 obj_04 - type_3
obj_08 obj_01 obj_07 - type_2
obj_09 obj_02 obj_05 - object)
(:init
(pred_1 obj_03 obj_07)
(pred_4 obj_03 obj_06)
(pred_4 obj_03 obj_04)
(pred_3 obj_09 obj_01)
(pred_3 obj_02 obj_08)
(pred_3 obj_05 obj_08)
)
(:goal
(and
(pred_3 obj_09 obj_07)
(pred_3 obj_02 obj_08)
(pred_3 obj_05 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_03 ?b obj_06))))
)
)

; plan
1. (op_2 obj_03 obj_07 obj_01)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_01)
   goals met: 1 of 3
2. (op_3 obj_03 obj_09 obj_01 obj_04)
   deleted: (pred_3 obj_09 obj_01) (pred_4 obj_03 obj_04)
   added: (pred_2 obj_03 obj_09 obj_04)
   goals met: 1 of 3
3. (op_2 obj_03 obj_01 obj_08)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_08)
   goals met: 1 of 3
4. (op_2 obj_03 obj_08 obj_07)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_07)
   goals met: 1 of 3
5. (op_1 obj_03 obj_09 obj_07 obj_04)
   deleted: (pred_2 obj_03 obj_09 obj_04)
   added: (pred_3 obj_09 obj_07) (pred_4 obj_03 obj_04)
   goals met: 2 of 3
6. (op_2 obj_03 obj_07 obj_08)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_08)
   goals met: 2 of 3
7. (op_3 obj_03 obj_05 obj_08 obj_04)
   deleted: (pred_3 obj_05 obj_08) (pred_4 obj_03 obj_04)
   added: (pred_2 obj_03 obj_05 obj_04)
   goals met: 2 of 3
8. (op_2 obj_03 obj_08 obj_07)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_07)
   goals met: 2 of 3
9. (op_1 obj_03 obj_05 obj_07 obj_04)
   deleted: (pred_2 obj_03 obj_05 obj_04)
   added: (pred_3 obj_05 obj_07) (pred_4 obj_03 obj_04)
   goals met: 3 of 3
